Jaxc/meta-skrooter/cube-project/stmp157-olinuxino-lime2.ioc
#MicroXplorer Configuration settings - do not modify
ADC1.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_1
ADC1.CommonPathInternal=null|null|null|null
ADC1.IPParameters=Rank-0\#ChannelRegularConversion,Channel-0\#ChannelRegularConversion,SingleDiff-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,OffsetNumber-0\#ChannelRegularConversion,NbrOfConversionFlag,master,CommonPathInternal
ADC1.NbrOfConversionFlag=1
ADC1.OffsetNumber-0\#ChannelRegularConversion=ADC_OFFSET_NONE
ADC1.Rank-0\#ChannelRegularConversion=1
ADC1.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_1CYCLE_5
ADC1.SingleDiff-0\#ChannelRegularConversion=ADC_DIFFERENTIAL_ENDED
ADC1.master=1
ADC2.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_18
ADC2.CommonPathInternal=null|null|null|null
ADC2.IPParameters=Rank-0\#ChannelRegularConversion,Channel-0\#ChannelRegularConversion,SingleDiff-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,OffsetNumber-0\#ChannelRegularConversion,NbrOfConversionFlag,CommonPathInternal
ADC2.NbrOfConversionFlag=1
ADC2.OffsetNumber-0\#ChannelRegularConversion=ADC_OFFSET_NONE
ADC2.Rank-0\#ChannelRegularConversion=1
ADC2.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_1CYCLE_5
ADC2.SingleDiff-0\#ChannelRegularConversion=ADC_DIFFERENTIAL_ENDED
ANA0.Locked=true
ANA0.Signal=ADCx_INN1
ANA1.Locked=true
ANA1.Signal=ADCx_INP1
BootLoader.IPs=DDR,RCC,TAMP,QUADSPI,SDMMC2,FMC,I2C4,SDMMC1,USB_OTG_HS,UART4\:I
BootROM.IPs=RCC,TAMP,QUADSPI,SDMMC2,FMC,SDMMC1\:I,USB_OTG_HS,UART4
CAD.formats=
CAD.pinconfig=
CAD.provider=
CortexA7NS.IPs=BSEC,DDR\:I,ETZPC,HSEM\:I,IPCC\:I,PWR,RCC\:I,RTC,TAMP\:I,GPIO,DMA\:I,GIC,GPU\:I,SDMMC2\:I,FMC\:I,QUADSPI\:I,I2C4\:I,ADC2\:I,ADC1\:I,SDMMC1,LTDC\:I,I2S1\:I,SPI1\:I,SAI4\:I,DSIHOST\:I,I2C1\:I,ETH1\:I,USB_OTG_HS\:I,USBH_HS1\:I,USBH_HS2\:I,DCMI\:I,DEBUG\:I,UART4
CortexA7S.IPs=BSEC\:I,DDR,ETZPC\:I,HSEM,PWR\:I,RCC,RNG1\:I,RTC\:I,TAMP,GIC\:I
CortexM4.IPs=IPCC,ETZPC,FREERTOS\:I,HSEM,PWR,RCC,SYS\:I,GPIO,DMA,NVIC\:I
DDR.CL=7
DDR.DDR_Frequency=533.0
DDR.DFITMG0=0x02050105
DDR.DRAMTMG0=0x121B2414
DDR.DRAMTMG1=0x000A041B
DDR.DRAMTMG2=0x0607080F
DDR.DRAMTMG4=0x07040607
DDR.DTPR0=0x36D477D0
DDR.IPParameters=DDR_Frequency,CL,addrmap_col_b9,addrmap_col_b10,addrmap_col_b11,addrmap_bank_b0,addrmap_bank_b1,addrmap_bank_b2,addrmap_row_b0,addrmap_row_b1,addrmap_row_b2_10,addrmap_row_b11,addrmap_row_b12,addrmap_row_b13,addrmap_row_b14,addrmap_row_b15,DRAMTMG0,DRAMTMG1,DRAMTMG2,SCHED,DTPR0,MR0,RELAXED_TIMING_MODE,wr2pre,t_faw,t_ras_max,t_ras_min,t_xp,t_rd2pre,t_rp,t_rc,write_latency,read_latency,wr2rd,t_rcd,t_rrd,t_cksrx,t_cksre,t_ckesr,t_cke,t_xs_dll_x32,t_xs_x32,t_rfc_nom_x1_x32,t_rfc_min,dfi_t_rddata_en,dfi_tphy_wrlat,tdlllock,tdllsrst,tdinit1,tdinit0,tdinit2,tccd,trc,trrd,tras,trcd,trp,twtr,trtp,tmrd,trfc,tmod,tfaw,tdllk,tcke,txp,txs,MR0.WR,MR0.CL,MR2.RTT,MR2.CWL,SPEED_BIN_GRADE,tRCD,tRP,tRC,DFITMG0,DRAMTMG4
DDR.MR0=0x00000830
DDR.MR0.CL=2
DDR.MR0.WR=1
DDR.MR2.CWL=0
DDR.MR2.RTT=1
DDR.RELAXED_TIMING_MODE=false
DDR.SCHED=0x00000C01
DDR.SPEED_BIN_GRADE=SPEED BIN GRADE CONFIG1
DDR.addrmap_bank_b0=8
DDR.addrmap_bank_b1=8
DDR.addrmap_bank_b2=8
DDR.addrmap_col_b10=31
DDR.addrmap_col_b11=31
DDR.addrmap_col_b9=0
DDR.addrmap_row_b0=7
DDR.addrmap_row_b1=7
DDR.addrmap_row_b11=7
DDR.addrmap_row_b12=7
DDR.addrmap_row_b13=7
DDR.addrmap_row_b14=7
DDR.addrmap_row_b15=15
DDR.addrmap_row_b2_10=7
DDR.dfi_t_rddata_en=4
DDR.dfi_tphy_wrlat=4
DDR.read_latency=6
DDR.tRC=50.625
DDR.tRCD=13.125
DDR.tRP=13.125
DDR.t_cke=3
DDR.t_ckesr=2
DDR.t_cksre=5
DDR.t_cksrx=5
DDR.t_faw=8
DDR.t_ras_max=1
DDR.t_ras_min=3
DDR.t_rc=6
DDR.t_rcd=3
DDR.t_rd2pre=4
DDR.t_rfc_min=7
DDR.t_rfc_nom_x1_x32=6
DDR.t_rp=3
DDR.t_rrd=4
DDR.t_xp=10
DDR.t_xs_dll_x32=16
DDR.t_xs_x32=5
DDR.tccd=0
DDR.tcke=4
DDR.tdinit0=12500
DDR.tdinit1=7
DDR.tdinit2=5000
DDR.tdllk=512
DDR.tdlllock=128
DDR.tdllsrst=8
DDR.tfaw=8
DDR.tmod=0
DDR.tmrd=0
DDR.tras=3
DDR.trc=6
DDR.trcd=3
DDR.trfc=7
DDR.trp=3
DDR.trrd=4
DDR.trtp=4
DDR.twtr=6
DDR.txp=10
DDR.txs=512
DDR.wr2pre=12
DDR.wr2rd=14
DDR.write_latency=5
DDR_A0.Mode=DDR3
DDR_A0.Signal=DDR_A0
DDR_A1.Mode=DDR3
DDR_A1.Signal=DDR_A1
DDR_A10.Mode=DDR3
DDR_A10.Signal=DDR_A10
DDR_A11.Mode=DDR3
DDR_A11.Signal=DDR_A11
DDR_A12.Mode=8Gb_32bits
DDR_A12.Signal=DDR_A12
DDR_A13.Mode=8Gb_32bits
DDR_A13.Signal=DDR_A13
DDR_A14.Mode=8Gb_32bits
DDR_A14.Signal=DDR_A14
DDR_A2.Mode=DDR3
DDR_A2.Signal=DDR_A2
DDR_A3.Mode=DDR3
DDR_A3.Signal=DDR_A3
DDR_A4.Mode=DDR3
DDR_A4.Signal=DDR_A4
DDR_A5.Mode=DDR3
DDR_A5.Signal=DDR_A5
DDR_A6.Mode=DDR3
DDR_A6.Signal=DDR_A6
DDR_A7.Mode=DDR3
DDR_A7.Signal=DDR_A7
DDR_A8.Mode=DDR3
DDR_A8.Signal=DDR_A8
DDR_A9.Mode=DDR3
DDR_A9.Signal=DDR_A9
DDR_ATO.Mode=DDR3
DDR_ATO.Signal=DDR_ATO
DDR_BA0.Mode=DDR3
DDR_BA0.Signal=DDR_BA0
DDR_BA1.Mode=DDR3
DDR_BA1.Signal=DDR_BA1
DDR_BA2.Mode=DDR3
DDR_BA2.Signal=DDR_BA2
DDR_CASN.Mode=DDR3
DDR_CASN.Signal=DDR_CASN
DDR_CKE.Mode=DDR3
DDR_CKE.Signal=DDR_CKE
DDR_CLKN.Mode=DDR3
DDR_CLKN.Signal=DDR_CLKN
DDR_CLKP.Mode=DDR3
DDR_CLKP.Signal=DDR_CLKP
DDR_CSN.Mode=DDR3
DDR_CSN.Signal=DDR_CSN
DDR_DQ0.Mode=DDR3
DDR_DQ0.Signal=DDR_DQ0
DDR_DQ1.Mode=DDR3
DDR_DQ1.Signal=DDR_DQ1
DDR_DQ10.Mode=DDR3
DDR_DQ10.Signal=DDR_DQ10
DDR_DQ11.Mode=DDR3
DDR_DQ11.Signal=DDR_DQ11
DDR_DQ12.Mode=DDR3
DDR_DQ12.Signal=DDR_DQ12
DDR_DQ13.Mode=DDR3
DDR_DQ13.Signal=DDR_DQ13
DDR_DQ14.Mode=DDR3
DDR_DQ14.Signal=DDR_DQ14
DDR_DQ15.Mode=DDR3
DDR_DQ15.Signal=DDR_DQ15
DDR_DQ16.Mode=32bits
DDR_DQ16.Signal=DDR_DQ16
DDR_DQ17.Mode=32bits
DDR_DQ17.Signal=DDR_DQ17
DDR_DQ18.Mode=32bits
DDR_DQ18.Signal=DDR_DQ18
DDR_DQ19.Mode=32bits
DDR_DQ19.Signal=DDR_DQ19
DDR_DQ2.Mode=DDR3
DDR_DQ2.Signal=DDR_DQ2
DDR_DQ20.Mode=32bits
DDR_DQ20.Signal=DDR_DQ20
DDR_DQ21.Mode=32bits
DDR_DQ21.Signal=DDR_DQ21
DDR_DQ22.Mode=32bits
DDR_DQ22.Signal=DDR_DQ22
DDR_DQ23.Mode=32bits
DDR_DQ23.Signal=DDR_DQ23
DDR_DQ24.Mode=32bits
DDR_DQ24.Signal=DDR_DQ24
DDR_DQ25.Mode=32bits
DDR_DQ25.Signal=DDR_DQ25
DDR_DQ26.Mode=32bits
DDR_DQ26.Signal=DDR_DQ26
DDR_DQ27.Mode=32bits
DDR_DQ27.Signal=DDR_DQ27
DDR_DQ28.Mode=32bits
DDR_DQ28.Signal=DDR_DQ28
DDR_DQ29.Mode=32bits
DDR_DQ29.Signal=DDR_DQ29
DDR_DQ3.Mode=DDR3
DDR_DQ3.Signal=DDR_DQ3
DDR_DQ30.Mode=32bits
DDR_DQ30.Signal=DDR_DQ30
DDR_DQ31.Mode=32bits
DDR_DQ31.Signal=DDR_DQ31
DDR_DQ4.Mode=DDR3
DDR_DQ4.Signal=DDR_DQ4
DDR_DQ5.Mode=DDR3
DDR_DQ5.Signal=DDR_DQ5
DDR_DQ6.Mode=DDR3
DDR_DQ6.Signal=DDR_DQ6
DDR_DQ7.Mode=DDR3
DDR_DQ7.Signal=DDR_DQ7
DDR_DQ8.Mode=DDR3
DDR_DQ8.Signal=DDR_DQ8
DDR_DQ9.Mode=DDR3
DDR_DQ9.Signal=DDR_DQ9
DDR_DQM0.Mode=DDR3
DDR_DQM0.Signal=DDR_DQM0
DDR_DQM1.Mode=DDR3
DDR_DQM1.Signal=DDR_DQM1
DDR_DQM2.Mode=32bits
DDR_DQM2.Signal=DDR_DQM2
DDR_DQM3.Mode=32bits
DDR_DQM3.Signal=DDR_DQM3
DDR_DQS0N.Mode=DDR3
DDR_DQS0N.Signal=DDR_DQS0N
DDR_DQS0P.Mode=DDR3
DDR_DQS0P.Signal=DDR_DQS0P
DDR_DQS1N.Mode=DDR3
DDR_DQS1N.Signal=DDR_DQS1N
DDR_DQS1P.Mode=DDR3
DDR_DQS1P.Signal=DDR_DQS1P
DDR_DQS2N.Mode=32bits
DDR_DQS2N.Signal=DDR_DQS2N
DDR_DQS2P.Mode=32bits
DDR_DQS2P.Signal=DDR_DQS2P
DDR_DQS3N.Mode=32bits
DDR_DQS3N.Signal=DDR_DQS3N
DDR_DQS3P.Mode=32bits
DDR_DQS3P.Signal=DDR_DQS3P
DDR_DTO0.Mode=DDR3
DDR_DTO0.Signal=DDR_DTO0
DDR_DTO1.Mode=DDR3
DDR_DTO1.Signal=DDR_DTO1
DDR_ODT.Mode=DDR3
DDR_ODT.Signal=DDR_ODT
DDR_RASN.Mode=DDR3
DDR_RASN.Signal=DDR_RASN
DDR_RESETN.Mode=DDR3
DDR_RESETN.Signal=DDR_RESETN
DDR_VREF.Mode=DDR3
DDR_VREF.Signal=DDR_VREF
DDR_WEN.Mode=DDR3
DDR_WEN.Signal=DDR_WEN
DDR_ZQ.Mode=DDR3
DDR_ZQ.Signal=DDR_ZQ
Dma.Request0=SAI4_A
Dma.RequestsNb=1
Dma.SAI4_A.0.Direction=DMA_MEMORY_TO_PERIPH
Dma.SAI4_A.0.EventEnable=DISABLE
Dma.SAI4_A.0.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.SAI4_A.0.Instance=DMA1_Stream0
Dma.SAI4_A.0.MDMA_Chaining=ENABLE
Dma.SAI4_A.0.Mandatory=DISABLE
Dma.SAI4_A.0.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.SAI4_A.0.MemInc=DMA_MINC_ENABLE
Dma.SAI4_A.0.Mode=DMA_NORMAL
Dma.SAI4_A.0.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Dma.SAI4_A.0.PeriphInc=DMA_PINC_DISABLE
Dma.SAI4_A.0.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.SAI4_A.0.Priority=DMA_PRIORITY_LOW
Dma.SAI4_A.0.RequestNumber=1
Dma.SAI4_A.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber,MDMA_Chaining,Mandatory
Dma.SAI4_A.0.SignalID=NONE
Dma.SAI4_A.0.SyncEnable=DISABLE
Dma.SAI4_A.0.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.SAI4_A.0.SyncRequestNumber=1
Dma.SAI4_A.0.SyncSignalID=NONE
File.Version=6
GIC.ADC1_IRQn=true\:false\:High level
GIC.ADC2_IRQn=true\:false\:High level
GIC.DMA1_Stream0_IRQn=true\:false\:High level
GIC.DMA1_Stream1_IRQn=true\:false\:High level
GIC.DMA1_Stream2_IRQn=true\:false\:High level
GIC.DMA1_Stream3_IRQn=true\:false\:High level
GIC.DMA1_Stream4_IRQn=true\:false\:High level
GIC.DMA1_Stream5_IRQn=true\:false\:High level
GIC.DMA1_Stream6_IRQn=true\:false\:High level
GIC.DMA1_Stream7_IRQn=true\:false\:High level
GIC.ETH1_IRQn=true\:false\:High level
GIC.ETH1_WKUP_IRQn=true\:false\:High level
GIC.FMC_IRQn=true\:false\:High level
GIC.GPU_IRQn=true\:false\:High level
GIC.I2C1_ER_IRQn=true\:false\:High level
GIC.I2C1_EV_IRQn=true\:false\:High level
GIC.I2C4_ER_IRQn=true\:false\:High level
GIC.I2C4_EV_IRQn=true\:false\:High level
GIC.IPCC_RX0_IRQn=true\:false\:High level
GIC.IPCC_TX0_IRQn=true\:false\:High level
GIC.LTDC_ER_IRQn=true\:false\:High level
GIC.LTDC_IRQn=true\:false\:High level
GIC.MDMA_IRQn=true\:false\:High level
GIC.QUADSPI_IRQn=true\:false\:High level
GIC.RCC_IRQn=true\:false\:High level
GIC.RTC_WKUP_ALARM_IRQn=true\:false\:High level
GIC.SAI4_IRQn=true\:false\:High level
GIC.SDMMC1_IRQn=true\:false\:High level
GIC.SDMMC2_IRQn=true\:false\:High level
GIC.SPI1_IRQn=true\:false\:High level
GIC.UART4_IRQn=true\:false\:High level
GIC.USBH_EHCI_IRQn=true\:false\:High level
GIC.USBH_OHCI_IRQn=true\:false\:High level
GIC.WAKEUP_PIN_IRQn=true\:false\:High level
GPIO.groupedBy=Group By Peripherals
I2C1.IPParameters=Timing
I2C1.Timing=0x4050527A
I2C4.IPParameters=Timing
I2C4.Timing=0x4050527A
JTCK-SWCLK.Locked=true
JTCK-SWCLK.Mode=Serial_Wire
JTCK-SWCLK.Signal=DEBUG_JTCK-SWCLK
JTDI.Locked=true
JTDI.Signal=DEBUG_JTDI
JTDO-TRACESWO.Locked=true
JTDO-TRACESWO.Signal=DEBUG_JTDO-SWO
JTMS-SWDIO.Locked=true
JTMS-SWDIO.Mode=Serial_Wire
JTMS-SWDIO.Signal=DEBUG_JTMS-SWDIO
KeepUserPlacement=true
Mcu.CPN=STM32MP157DAA1
Mcu.Context0=BootROM
Mcu.Context1=BootLoader
Mcu.Context2=CortexA7S
Mcu.Context3=CortexA7NS
Mcu.Context4=CortexM4
Mcu.ContextNb=5
Mcu.Family=STM32MP1
Mcu.IP0=ADC1
Mcu.IP1=ADC2
Mcu.IP10=GPU
Mcu.IP11=HSEM
Mcu.IP12=I2C1
Mcu.IP13=I2C4
Mcu.IP14=I2S1
Mcu.IP15=IPCC
Mcu.IP16=LTDC
Mcu.IP17=MDMA
Mcu.IP18=NVIC
Mcu.IP19=PWR
Mcu.IP2=BSEC
Mcu.IP20=QUADSPI
Mcu.IP21=RCC
Mcu.IP22=RTC
Mcu.IP23=SAI4
Mcu.IP24=SDMMC1
Mcu.IP25=SDMMC2
Mcu.IP26=SYS
Mcu.IP27=TAMP
Mcu.IP28=UART4
Mcu.IP29=USBH_HS1
Mcu.IP3=DDR
Mcu.IP30=USBH_HS2
Mcu.IP4=DEBUG
Mcu.IP5=DMA
Mcu.IP6=ETH1
Mcu.IP7=ETZPC
Mcu.IP8=FMC
Mcu.IP9=GIC
Mcu.IPNb=31
Mcu.Name=STM32MP157DAAx
Mcu.Package=LFBGA448
Mcu.Pin0=PE13
Mcu.Pin1=PK6
Mcu.Pin10=DDR_DQ20
Mcu.Pin100=DDR_A1
Mcu.Pin101=DDR_RASN
Mcu.Pin102=DDR_WEN
Mcu.Pin103=DDR_CASN
Mcu.Pin104=PI8
Mcu.Pin105=DDR_A10
Mcu.Pin106=DDR_A12
Mcu.Pin107=DDR_CLKP
Mcu.Pin108=DDR_CLKN
Mcu.Pin109=DDR_DQ8
Mcu.Pin11=DDR_DQ23
Mcu.Pin110=PC14-OSC32_IN
Mcu.Pin111=PC15-OSC32_OUT
Mcu.Pin112=DDR_A14
Mcu.Pin113=DDR_A11
Mcu.Pin114=DDR_DQ10
Mcu.Pin115=ANA0
Mcu.Pin116=DDR_BA1
Mcu.Pin117=DDR_CKE
Mcu.Pin118=DDR_DQ13
Mcu.Pin119=DDR_DQ9
Mcu.Pin12=PK3
Mcu.Pin120=DDR_DQS1N
Mcu.Pin121=PH0-OSC_IN
Mcu.Pin122=PH1-OSC_OUT
Mcu.Pin123=ANA1
Mcu.Pin124=DDR_A4
Mcu.Pin125=DDR_DQ11
Mcu.Pin126=DDR_DQM1
Mcu.Pin127=DDR_DQS1P
Mcu.Pin128=PA5
Mcu.Pin129=PG5
Mcu.Pin13=PJ14
Mcu.Pin130=PG11
Mcu.Pin131=DDR_A8
Mcu.Pin132=DDR_A6
Mcu.Pin133=DDR_DQ14
Mcu.Pin134=PA1
Mcu.Pin135=PA4
Mcu.Pin136=PF14
Mcu.Pin137=PF10
Mcu.Pin138=PB2
Mcu.Pin139=DDR_DQ12
Mcu.Pin14=PJ12
Mcu.Pin140=DDR_DQ15
Mcu.Pin141=DDR_DQ24
Mcu.Pin142=PG0
Mcu.Pin143=PE7
Mcu.Pin144=PE9
Mcu.Pin145=PD12
Mcu.Pin146=PB6
Mcu.Pin147=PE10
Mcu.Pin148=PG9
Mcu.Pin149=DDR_DQ25
Mcu.Pin15=PD1
Mcu.Pin150=DDR_DQ31
Mcu.Pin151=DDR_DQ30
Mcu.Pin152=PC2
Mcu.Pin153=PE2
Mcu.Pin154=PB11
Mcu.Pin155=PA7
Mcu.Pin156=PE8
Mcu.Pin157=DDR_DQS3P
Mcu.Pin158=DDR_DQS3N
Mcu.Pin159=PG13
Mcu.Pin16=PD3
Mcu.Pin160=PG14
Mcu.Pin161=PA0
Mcu.Pin162=PB1
Mcu.Pin163=PC5
Mcu.Pin164=PB5
Mcu.Pin165=PF7
Mcu.Pin166=PF6
Mcu.Pin167=USB_DM2
Mcu.Pin168=USB_DP1
Mcu.Pin169=DDR_ATO
Mcu.Pin17=PB15
Mcu.Pin170=DDR_DQ29
Mcu.Pin171=DDR_DQ28
Mcu.Pin172=DDR_DQM3
Mcu.Pin173=PA2
Mcu.Pin174=PC1
Mcu.Pin175=PG4
Mcu.Pin176=PB0
Mcu.Pin177=PC4
Mcu.Pin178=PD11
Mcu.Pin179=PF8
Mcu.Pin18=PA8
Mcu.Pin180=PF9
Mcu.Pin181=USB_DP2
Mcu.Pin182=USB_DM1
Mcu.Pin183=DDR_VREF
Mcu.Pin184=DDR_DQ27
Mcu.Pin185=DDR_DQ26
Mcu.Pin186=VP_BSEC_VS_BSEC
Mcu.Pin187=VP_DDR_DDR3
Mcu.Pin188=VP_DDR_DDR_32_bits
Mcu.Pin189=VP_DDR_DDR3_32_8Gb
Mcu.Pin19=DDR_DQ19
Mcu.Pin190=VP_ETZPC_VS_ETZPC
Mcu.Pin191=VP_GPU_VS_GPU
Mcu.Pin192=VP_HSEM_VS_HSEM
Mcu.Pin193=VP_IPCC_VS_IPCC
Mcu.Pin194=VP_RTC_VS_RTC_Activate
Mcu.Pin195=VP_SYS_VS_Systick
Mcu.Pin196=VP_TAMP_VS_TAMP_Activate
Mcu.Pin197=VP_DMA_VS_DMA1_A7NS
Mcu.Pin198=VP_DMA_VS_DMA2_M4
Mcu.Pin199=VP_MDMA_VS_MDMA_A7NS_8
Mcu.Pin2=PK4
Mcu.Pin20=DDR_DQ16
Mcu.Pin21=DDR_DQS2N
Mcu.Pin22=PK5
Mcu.Pin23=PJ15
Mcu.Pin24=PD4
Mcu.Pin25=PD0
Mcu.Pin26=PE5
Mcu.Pin27=PB4
Mcu.Pin28=DDR_DQS2P
Mcu.Pin29=DDR_DQM2
Mcu.Pin3=PJ13
Mcu.Pin30=PI14
Mcu.Pin31=PK0
Mcu.Pin32=PG6
Mcu.Pin33=PD2
Mcu.Pin34=PC9
Mcu.Pin35=PC11
Mcu.Pin36=JTDI
Mcu.Pin37=JTCK-SWCLK
Mcu.Pin38=DDR_DQ22
Mcu.Pin39=DDR_DQ17
Mcu.Pin4=PD10
Mcu.Pin40=DDR_DQ18
Mcu.Pin41=PK1
Mcu.Pin42=PK2
Mcu.Pin43=PC12
Mcu.Pin44=PC8
Mcu.Pin45=NJTRST
Mcu.Pin46=JTDO-TRACESWO
Mcu.Pin47=JTMS-SWDIO
Mcu.Pin48=DDR_DQ3
Mcu.Pin49=DDR_DQ0
Mcu.Pin5=PD5
Mcu.Pin50=DDR_DQ21
Mcu.Pin51=PI15
Mcu.Pin52=PZ3
Mcu.Pin53=PB9
Mcu.Pin54=PC10
Mcu.Pin55=DDR_A7
Mcu.Pin56=DDR_RESETN
Mcu.Pin57=DDR_DQ1
Mcu.Pin58=PZ4
Mcu.Pin59=PZ0
Mcu.Pin6=PE3
Mcu.Pin60=DDR_A13
Mcu.Pin61=DDR_DQ7
Mcu.Pin62=DDR_DQM0
Mcu.Pin63=DDR_DQS0N
Mcu.Pin64=DDR_DQS0P
Mcu.Pin65=PI13
Mcu.Pin66=PI12
Mcu.Pin67=PZ5
Mcu.Pin68=PJ8
Mcu.Pin69=DDR_A9
Mcu.Pin7=PA9
Mcu.Pin70=DDR_A5
Mcu.Pin71=DDR_DQ5
Mcu.Pin72=DDR_DQ2
Mcu.Pin73=DDR_DQ6
Mcu.Pin74=PJ3
Mcu.Pin75=PJ0
Mcu.Pin76=PJ10
Mcu.Pin77=DDR_A2
Mcu.Pin78=DDR_A3
Mcu.Pin79=DDR_DQ4
Mcu.Pin8=PB3
Mcu.Pin80=PJ5
Mcu.Pin81=PJ4
Mcu.Pin82=PJ2
Mcu.Pin83=PZ2
Mcu.Pin84=PJ11
Mcu.Pin85=DDR_BA2
Mcu.Pin86=DDR_A0
Mcu.Pin87=DDR_BA0
Mcu.Pin88=DDR_DTO1
Mcu.Pin89=DDR_ZQ
Mcu.Pin9=PB14
Mcu.Pin90=PD15
Mcu.Pin91=PJ9
Mcu.Pin92=PD6
Mcu.Pin93=PJ7
Mcu.Pin94=PJ6
Mcu.Pin95=PJ1
Mcu.Pin96=DDR_CSN
Mcu.Pin97=DDR_ODT
Mcu.Pin98=DDR_DTO0
Mcu.Pin99=PD14
Mcu.PinsNb=200
Mcu.ThirdPartyNb=0
Mcu.UserConstants=
Mcu.UserName=STM32MP157DAAx
Mdma.MDMA_Channel16.FMC_DATA.0.BlockCount=0
Mdma.MDMA_Channel16.FMC_DATA.0.BlockDataLength=0
Mdma.MDMA_Channel16.FMC_DATA.0.BufferTransferLength=1
Mdma.MDMA_Channel16.FMC_DATA.0.CircularMode=MDMA_LINEAR_LIST
Mdma.MDMA_Channel16.FMC_DATA.0.DataAlignment=MDMA_DATAALIGN_PACKENABLE
Mdma.MDMA_Channel16.FMC_DATA.0.DestBlockAddressOffset=0
Mdma.MDMA_Channel16.FMC_DATA.0.DestBurst=MDMA_DEST_BURST_SINGLE
Mdma.MDMA_Channel16.FMC_DATA.0.DestDataSize=MDMA_DEST_DATASIZE_BYTE
Mdma.MDMA_Channel16.FMC_DATA.0.DestinationInc=MDMA_DEST_INC_BYTE
Mdma.MDMA_Channel16.FMC_DATA.0.DstAddress=0
Mdma.MDMA_Channel16.FMC_DATA.0.Endianness=MDMA_LITTLE_ENDIANNESS_PRESERVE
Mdma.MDMA_Channel16.FMC_DATA.0.Instance=MDMA_Channel16
Mdma.MDMA_Channel16.FMC_DATA.0.Mandatory=DISABLE
Mdma.MDMA_Channel16.FMC_DATA.0.MaskAddress=0
Mdma.MDMA_Channel16.FMC_DATA.0.MaskData=0
Mdma.MDMA_Channel16.FMC_DATA.0.Priority=MDMA_PRIORITY_LOW
Mdma.MDMA_Channel16.FMC_DATA.0.Rank=First
Mdma.MDMA_Channel16.FMC_DATA.0.RequestParameters=Instance,CircularMode,TransferTriggerMode,Priority,Endianness,SourceInc,DestinationInc,SourceDataSize,DestDataSize,DataAlignment,BufferTransferLength,SourceBurst,DestBurst,SourceBlockAddressOffset,DestBlockAddressOffset,MaskAddress,MaskData,SrcAddress,DstAddress,BlockDataLength,BlockCount,Rank,Mandatory
Mdma.MDMA_Channel16.FMC_DATA.0.SourceBlockAddressOffset=0
Mdma.MDMA_Channel16.FMC_DATA.0.SourceBurst=MDMA_SOURCE_BURST_SINGLE
Mdma.MDMA_Channel16.FMC_DATA.0.SourceDataSize=MDMA_SRC_DATASIZE_BYTE
Mdma.MDMA_Channel16.FMC_DATA.0.SourceInc=MDMA_SRC_INC_BYTE
Mdma.MDMA_Channel16.FMC_DATA.0.SrcAddress=0
Mdma.MDMA_Channel16.FMC_DATA.0.TransferTriggerMode=MDMA_BUFFER_TRANSFER
Mdma.MDMA_Channel16.Request0=FMC_DATA
Mdma.MDMA_Channel16.RequestsNb=1
Mdma.MDMA_Channel17.FMC_ERROR.0.BlockCount=0
Mdma.MDMA_Channel17.FMC_ERROR.0.BlockDataLength=0
Mdma.MDMA_Channel17.FMC_ERROR.0.BufferTransferLength=1
Mdma.MDMA_Channel17.FMC_ERROR.0.CircularMode=MDMA_LINEAR_LIST
Mdma.MDMA_Channel17.FMC_ERROR.0.DataAlignment=MDMA_DATAALIGN_PACKENABLE
Mdma.MDMA_Channel17.FMC_ERROR.0.DestBlockAddressOffset=0
Mdma.MDMA_Channel17.FMC_ERROR.0.DestBurst=MDMA_DEST_BURST_SINGLE
Mdma.MDMA_Channel17.FMC_ERROR.0.DestDataSize=MDMA_DEST_DATASIZE_BYTE
Mdma.MDMA_Channel17.FMC_ERROR.0.DestinationInc=MDMA_DEST_INC_BYTE
Mdma.MDMA_Channel17.FMC_ERROR.0.DstAddress=0
Mdma.MDMA_Channel17.FMC_ERROR.0.Endianness=MDMA_LITTLE_ENDIANNESS_PRESERVE
Mdma.MDMA_Channel17.FMC_ERROR.0.Instance=MDMA_Channel17
Mdma.MDMA_Channel17.FMC_ERROR.0.Mandatory=DISABLE
Mdma.MDMA_Channel17.FMC_ERROR.0.MaskAddress=0
Mdma.MDMA_Channel17.FMC_ERROR.0.MaskData=0
Mdma.MDMA_Channel17.FMC_ERROR.0.Priority=MDMA_PRIORITY_LOW
Mdma.MDMA_Channel17.FMC_ERROR.0.Rank=First
Mdma.MDMA_Channel17.FMC_ERROR.0.RequestParameters=Instance,CircularMode,TransferTriggerMode,Priority,Endianness,SourceInc,DestinationInc,SourceDataSize,DestDataSize,DataAlignment,BufferTransferLength,SourceBurst,DestBurst,SourceBlockAddressOffset,DestBlockAddressOffset,MaskAddress,MaskData,SrcAddress,DstAddress,BlockDataLength,BlockCount,Rank,Mandatory
Mdma.MDMA_Channel17.FMC_ERROR.0.SourceBlockAddressOffset=0
Mdma.MDMA_Channel17.FMC_ERROR.0.SourceBurst=MDMA_SOURCE_BURST_SINGLE
Mdma.MDMA_Channel17.FMC_ERROR.0.SourceDataSize=MDMA_SRC_DATASIZE_BYTE
Mdma.MDMA_Channel17.FMC_ERROR.0.SourceInc=MDMA_SRC_INC_BYTE
Mdma.MDMA_Channel17.FMC_ERROR.0.SrcAddress=0
Mdma.MDMA_Channel17.FMC_ERROR.0.TransferTriggerMode=MDMA_BUFFER_TRANSFER
Mdma.MDMA_Channel17.Request0=FMC_ERROR
Mdma.MDMA_Channel17.RequestsNb=1
